[
  {
    "id": "const_art1",
    "source_type": "constitucion",
    "name": "Constitución Política del Perú",
    "article": "Artículo 1 — Dignidad humana",
    "full_text": "La defensa de la persona humana y el respeto de su dignidad son el fin supremo de la sociedad y del Estado.",
    "summary": "Tu dignidad es lo más importante. Cualquier trato que te humille o degrade es inconstitucional.",
    "publication_date": "1993-12-29",
    "last_modified": null,
    "official_url": "https://www.gob.pe/institucion/presidencia/normas-legales/20266-constitucion-politica-del-peru",
    "status": "vigente"
  },
  {
    "id": "const_art2_inc1",
    "source_type": "constitucion",
    "name": "Constitución Política del Perú",
    "article": "Artículo 2, inciso 1 — Vida, identidad e integridad",
    "full_text": "Toda persona tiene derecho a la vida, a su identidad, a su integridad moral, psíquica y física y a su libre desarrollo.",
    "summary": "La policía no puede atentar contra tu integridad física ni moral durante una intervención.",
    "publication_date": "1993-12-29",
    "last_modified": null,
    "official_url": "https://www.gob.pe/institucion/presidencia/normas-legales/20266-constitucion-politica-del-peru",
    "status": "vigente"
  },
  {
    "id": "const_art2_inc2",
    "source_type": "constitucion",
    "name": "Constitución Política del Perú",
    "article": "Artículo 2, inciso 2 — Igualdad y no discriminación",
    "full_text": "Toda persona tiene derecho a la igualdad ante la ley. Nadie debe ser discriminado por motivo de origen, raza, sexo, idioma, religión, opinión, condición económica o de cualquiera otra índole.",
    "summary": "Las intervenciones policiales no pueden basarse en perfilamiento racial, socioeconómico o étnico. Todo ciudadano recibe trato igualitario.",
    "publication_date": "1993-12-29",
    "last_modified": null,
    "official_url": "https://www.gob.pe/institucion/presidencia/normas-legales/20266-constitucion-politica-del-peru",
    "status": "vigente"
  },
  {
    "id": "const_art2_inc7",
    "source_type": "constitucion",
    "name": "Constitución Política del Perú",
    "article": "Artículo 2, inciso 7 — Honor, reputación e intimidad",
    "full_text": "Toda persona tiene derecho al honor y a la buena reputación, a la intimidad personal y familiar así como a la voz y a la imagen propias.",
    "summary": "La policía no puede exponerte públicamente ni exhibirte ante medios si no has sido declarado judicialmente responsable.",
    "publication_date": "1993-12-29",
    "last_modified": null,
    "official_url": "https://www.gob.pe/institucion/presidencia/normas-legales/20266-constitucion-politica-del-peru",
    "status": "vigente"
  },
  {
    "id": "const_art2_inc9",
    "source_type": "constitucion",
    "name": "Constitución Política del Perú",
    "article": "Artículo 2, inciso 9 — Inviolabilidad del domicilio",
    "full_text": "Nadie puede ingresar en él ni efectuar investigaciones o registros sin autorización de la persona que lo habita o sin mandato judicial, salvo flagrante delito o muy grave peligro de su perpetración.",
    "summary": "La policía solo puede entrar a tu casa con tu permiso, orden judicial, o si hay un delito ocurriendo adentro. Se puede restringir en estado de emergencia.",
    "publication_date": "1993-12-29",
    "last_modified": null,
    "official_url": "https://www.gob.pe/institucion/presidencia/normas-legales/20266-constitucion-politica-del-peru",
    "status": "vigente"
  },
  {
    "id": "const_art2_inc10",
    "source_type": "constitucion",
    "name": "Constitución Política del Perú",
    "article": "Artículo 2, inciso 10 — Secreto e inviolabilidad de comunicaciones",
    "full_text": "Las comunicaciones, telecomunicaciones o sus instrumentos solo pueden ser abiertos, incautados, interceptados o intervenidos por mandamiento motivado del juez. Los documentos privados obtenidos con violación de este precepto no tienen efecto legal.",
    "summary": "La policía NO puede revisar tu celular, correos, mensajes ni documentos privados sin orden judicial. Las pruebas obtenidas así son nulas.",
    "publication_date": "1993-12-29",
    "last_modified": null,
    "official_url": "https://www.gob.pe/institucion/presidencia/normas-legales/20266-constitucion-politica-del-peru",
    "status": "vigente"
  },
  {
    "id": "const_art2_inc11",
    "source_type": "constitucion",
    "name": "Constitución Política del Perú",
    "article": "Artículo 2, inciso 11 — Libertad de tránsito",
    "full_text": "Toda persona tiene derecho a elegir su lugar de residencia, a transitar por el territorio nacional y a salir de él y entrar en él, salvo limitaciones por razones de sanidad o por mandato judicial o por aplicación de la ley de extranjería.",
    "summary": "Puedes ir a donde quieras. La policía no puede restringir tu libre tránsito sin base legal. Se puede restringir en estado de emergencia.",
    "publication_date": "1993-12-29",
    "last_modified": null,
    "official_url": "https://www.gob.pe/institucion/presidencia/normas-legales/20266-constitucion-politica-del-peru",
    "status": "vigente"
  },
  {
    "id": "const_art2_inc12",
    "source_type": "constitucion",
    "name": "Constitución Política del Perú",
    "article": "Artículo 2, inciso 12 — Derecho de reunión",
    "full_text": "Toda persona tiene derecho a reunirse pacíficamente sin armas. Las reuniones en locales privados o abiertos al público no requieren aviso previo. Las que se convocan en plazas y vías públicas exigen anuncio anticipado a la autoridad, la que puede prohibirlas solamente por motivos probados de seguridad o de sanidad públicas.",
    "summary": "Puedes reunirte pacíficamente sin armas. Las reuniones en la calle requieren aviso previo. Se puede suspender en estado de emergencia.",
    "publication_date": "1993-12-29",
    "last_modified": null,
    "official_url": "https://www.gob.pe/institucion/presidencia/normas-legales/20266-constitucion-politica-del-peru",
    "status": "vigente"
  },
  {
    "id": "const_art2_inc24a",
    "source_type": "constitucion",
    "name": "Constitución Política del Perú",
    "article": "Artículo 2, inciso 24, literal a — Principio de libertad",
    "full_text": "Nadie está obligado a hacer lo que la ley no manda, ni impedido de hacer lo que ella no prohíbe.",
    "summary": "Si un policía te ordena algo que no está en la ley, no estás obligado a obedecer.",
    "publication_date": "1993-12-29",
    "last_modified": null,
    "official_url": "https://www.gob.pe/institucion/presidencia/normas-legales/20266-constitucion-politica-del-peru",
    "status": "vigente"
  },
  {
    "id": "const_art2_inc24e",
    "source_type": "constitucion",
    "name": "Constitución Política del Perú",
    "article": "Artículo 2, inciso 24, literal e — Presunción de inocencia",
    "full_text": "Toda persona es considerada inocente mientras no se haya declarado judicialmente su responsabilidad.",
    "summary": "Eres inocente hasta que un juez diga lo contrario. El policía debe tratarte como inocente en todo momento.",
    "publication_date": "1993-12-29",
    "last_modified": null,
    "official_url": "https://www.gob.pe/institucion/presidencia/normas-legales/20266-constitucion-politica-del-peru",
    "status": "vigente"
  },
  {
    "id": "const_art2_inc24f",
    "source_type": "constitucion",
    "name": "Constitución Política del Perú",
    "article": "Artículo 2, inciso 24, literal f — Detención legal",
    "full_text": "Nadie puede ser detenido sino por mandamiento escrito y motivado del juez o por las autoridades policiales en caso de flagrante delito. La detención no durará más del tiempo estrictamente necesario para la realización de las investigaciones y, en todo caso, el detenido debe ser puesto a disposición del juzgado correspondiente, dentro de las veinticuatro horas o en el término de la distancia. Estos plazos no se aplican a los casos de terrorismo, espionaje, tráfico ilícito de drogas y a los delitos cometidos por organizaciones criminales. En tales casos, las autoridades policiales pueden efectuar la detención preventiva de los presuntos implicados por un término no mayor de quince días naturales.",
    "summary": "Solo te pueden detener con orden judicial escrita o si te atrapan cometiendo un delito (flagrancia). Máximo 48 horas, salvo terrorismo/espionaje/TID (15 días).",
    "publication_date": "1993-12-29",
    "last_modified": "2017-08-10",
    "official_url": "https://www.gob.pe/institucion/presidencia/normas-legales/20266-constitucion-politica-del-peru",
    "status": "vigente"
  },
  {
    "id": "const_art2_inc24h",
    "source_type": "constitucion",
    "name": "Constitución Política del Perú",
    "article": "Artículo 2, inciso 24, literal h — Prohibición de tortura",
    "full_text": "Nadie debe ser víctima de violencia moral, psíquica o física, ni sometido a tortura o a tratos inhumanos o humillantes. Cualquiera puede pedir de inmediato el examen médico de la persona agraviada o de aquélla imposibilitada de recurrir por sí misma a la autoridad. Carecen de valor las declaraciones obtenidas por la violencia.",
    "summary": "Nadie puede torturarte ni darte tratos inhumanos. Las declaraciones obtenidas con violencia son nulas. Cualquiera puede pedir tu examen médico.",
    "publication_date": "1993-12-29",
    "last_modified": null,
    "official_url": "https://www.gob.pe/institucion/presidencia/normas-legales/20266-constitucion-politica-del-peru",
    "status": "vigente"
  },
  {
    "id": "const_art137",
    "source_type": "constitucion",
    "name": "Constitución Política del Perú",
    "article": "Artículo 137 — Régimen de excepción",
    "full_text": "El Presidente de la República, con acuerdo del Consejo de Ministros, puede decretar, por plazo determinado, en todo el territorio nacional, o en parte de él, y dando cuenta al Congreso o a la Comisión Permanente, los estados de excepción que en este artículo se contemplan: 1. Estado de emergencia, en caso de perturbación de la paz o del orden interno, de catástrofe o de graves circunstancias que afecten la vida de la Nación. En esta eventualidad, puede restringirse o suspenderse el ejercicio de los derechos constitucionales relativos a la libertad y la seguridad personales, la inviolabilidad del domicilio, y la libertad de reunión y de tránsito en el territorio. En ninguna circunstancia se puede desterrar a nadie. El plazo del estado de emergencia no excede de sesenta días.",
    "summary": "El estado de emergencia puede restringir SOLO 4 derechos: libertad personal, inviolabilidad de domicilio, libertad de tránsito y libertad de reunión. Máximo 60 días. Los demás derechos siguen intactos.",
    "publication_date": "1993-12-29",
    "last_modified": null,
    "official_url": "https://www.gob.pe/institucion/presidencia/normas-legales/20266-constitucion-politica-del-peru",
    "status": "vigente"
  },
  {
    "id": "const_art139_inc14",
    "source_type": "constitucion",
    "name": "Constitución Política del Perú",
    "article": "Artículo 139, inciso 14 — Derecho de defensa",
    "full_text": "El principio de no ser privado del derecho de defensa en ningún estado del proceso. Toda persona será informada inmediatamente y por escrito de la causa o las razones de su detención. Tiene derecho a comunicarse personalmente con un defensor de su elección y a ser asesorada por éste desde que es citada o detenida por cualquier autoridad.",
    "summary": "Si te detienen, deben decirte inmediatamente por escrito por qué. Tienes derecho a un abogado desde el primer momento.",
    "publication_date": "1993-12-29",
    "last_modified": null,
    "official_url": "https://www.gob.pe/institucion/presidencia/normas-legales/20266-constitucion-politica-del-peru",
    "status": "vigente"
  },
  {
    "id": "const_art200",
    "source_type": "constitucion",
    "name": "Constitución Política del Perú",
    "article": "Artículo 200 — Garantías constitucionales (Hábeas Corpus)",
    "full_text": "Son garantías constitucionales: 1. La Acción de Hábeas Corpus, que procede ante el hecho u omisión, por parte de cualquier autoridad, funcionario o persona, que vulnera o amenaza la libertad individual o los derechos constitucionales conexos. El ejercicio de las acciones de hábeas corpus y de amparo no se suspende durante la vigencia de los regímenes de excepción.",
    "summary": "El hábeas corpus es tu arma más poderosa: cualquiera puede presentarlo, sin abogado, verbalmente, ante cualquier juez. NO se suspende ni en estado de emergencia.",
    "publication_date": "1993-12-29",
    "last_modified": null,
    "official_url": "https://www.gob.pe/institucion/presidencia/normas-legales/20266-constitucion-politica-del-peru",
    "status": "vigente"
  }
]