[
  {
    "id": "cpp_art71",
    "source_type": "codigo_procesal",
    "name": "Código Procesal Penal",
    "article": "Artículo 71 — Derechos del imputado",
    "full_text": "El imputado puede hacer valer por sí mismo, o a través de su Abogado Defensor, los derechos que la Constitución y las Leyes le conceden, desde el inicio de las primeras diligencias de investigación hasta la culminación del proceso. Los Jueces, los Fiscales o la Policía Nacional deben hacer saber al imputado de manera inmediata y comprensible, que tiene derecho a: conocer los cargos formulados en su contra, designar a la persona o institución a la que debe comunicarse su detención, ser asistido desde los actos iniciales de investigación por un Abogado Defensor, abstenerse de declarar, y que no se emplee en su contra medios coactivos, intimidatorios o contrarios a su dignidad.",
    "summary": "Desde el primer momento tienes derecho a: saber por qué te detienen, llamar a alguien, tener abogado, no declarar, y que no te maltraten.",
    "publication_date": "2004-07-29",
    "last_modified": null,
    "official_url": "https://spij.minjus.gob.pe/spij-ext-web/detallegislacion/21702",
    "status": "vigente"
  },
  {
    "id": "cpp_art205",
    "source_type": "codigo_procesal",
    "name": "Código Procesal Penal",
    "article": "Artículo 205 — Control de identidad policial (modificado por DL 1574 y Ley 32130)",
    "full_text": "La Policía, en el marco de sus funciones, sin necesidad de orden del Fiscal o del Juez, podrá requerir la identificación de cualquier persona y realizar las comprobaciones pertinentes en la vía pública o en el lugar donde se hubiere hecho el requerimiento, cuando considere que resulta necesario para prevenir un delito u obtener información útil para la averiguación de un hecho punible. El intervenido tiene derecho a exigir al policía le proporcione su identidad y la dependencia a la que está asignado.",
    "summary": "La policía puede pedirte identificación sin orden judicial, pero solo cuando sea necesario para prevenir un delito. Tú también puedes exigirles que se identifiquen.",
    "publication_date": "2004-07-29",
    "last_modified": "2024-10-01",
    "official_url": "https://spij.minjus.gob.pe/spij-ext-web/detallegislacion/21702",
    "status": "vigente"
  },
  {
    "id": "cpp_art205_4",
    "source_type": "codigo_procesal",
    "name": "Código Procesal Penal",
    "article": "Artículo 205.4 — Retención por identificación",
    "full_text": "En caso no sea posible la exhibición del documento de identidad, según la gravedad del hecho investigado o del ámbito de la operación policial practicada, se conducirá al intervenido a la Dependencia Policial más cercana para exclusivos fines de identificación. Se podrá tomar las huellas digitales del intervenido y constatar si registra alguna requisitoria. Este procedimiento, contado desde el momento de la intervención policial, no puede exceder de cuatro horas, luego de las cuales se le permitirá retirarse.",
    "summary": "Si no tienes documento, pueden llevarte a la comisaría SOLO para identificarte. Máximo 4 horas (12 para extranjeros). No pueden meterte a celdas.",
    "publication_date": "2004-07-29",
    "last_modified": "2024-10-01",
    "official_url": "https://spij.minjus.gob.pe/spij-ext-web/detallegislacion/21702",
    "status": "vigente"
  },
  {
    "id": "cpp_art208",
    "source_type": "codigo_procesal",
    "name": "Código Procesal Penal",
    "article": "Artículo 208 — Inspección y pesquisas",
    "full_text": "La Policía podrá inspeccionar o disponer pesquisas en lugares abiertos, cosas o personas, cuando existan motivos plausibles para considerar que se encontrarán rastros del delito, o considere que en determinado lugar se oculta el imputado o alguna persona prófuga.",
    "summary": "La policía puede inspeccionar lugares y personas solo cuando haya motivos razonables para creer que encontrará evidencia de un delito.",
    "publication_date": "2004-07-29",
    "last_modified": null,
    "official_url": "https://spij.minjus.gob.pe/spij-ext-web/detallegislacion/21702",
    "status": "vigente"
  },
  {
    "id": "cpp_art209",
    "source_type": "codigo_procesal",
    "name": "Código Procesal Penal",
    "article": "Artículo 209 — Retención durante pesquisas",
    "full_text": "Durante la diligencia de inspección o pesquisa, la Policía podrá disponer que las personas halladas no se alejen antes de que la diligencia haya concluido ni comunicarse entre sí, siempre que dicha medida no exceda de cuatro horas y que no les impida el ejercicio de sus derechos.",
    "summary": "Durante una pesquisa, pueden pedirte que no te vayas, pero máximo 4 horas. Después necesitan orden judicial.",
    "publication_date": "2004-07-29",
    "last_modified": null,
    "official_url": "https://spij.minjus.gob.pe/spij-ext-web/detallegislacion/21702",
    "status": "vigente"
  },
  {
    "id": "cpp_art210",
    "source_type": "codigo_procesal",
    "name": "Código Procesal Penal",
    "article": "Artículo 210 — Registro de personas",
    "full_text": "La Policía, por sí —dando cuenta al Fiscal— o por orden de aquél, cuando existan fundadas razones para considerar que una persona oculta en su cuerpo o ámbito personal bienes relacionados con el delito, procederá a registrarla. Antes de su realización se invitará a la persona a que exhiba y entregue el bien buscado. Si el bien se presenta no se procederá al registro, salvo que se considere útil proceder a fin de completar las investigaciones. El registro se efectuará respetando la dignidad y, dentro de los límites posibles, el pudor de la persona. Corresponderá realizarlo a una persona del mismo sexo del intervenido.",
    "summary": "Solo pueden registrarte si hay razones fundadas de que ocultas algo de un delito. PRIMERO deben pedirte que lo muestres voluntariamente. El registro debe respetar tu dignidad y ser por alguien de tu mismo sexo.",
    "publication_date": "2004-07-29",
    "last_modified": null,
    "official_url": "https://spij.minjus.gob.pe/spij-ext-web/detallegislacion/21702",
    "status": "vigente"
  },
  {
    "id": "cpp_art259",
    "source_type": "codigo_procesal",
    "name": "Código Procesal Penal",
    "article": "Artículo 259 — Detención policial en flagrancia",
    "full_text": "La Policía Nacional del Perú detiene, sin mandato judicial, a quien sorprenda en flagrante delito. Existe flagrancia cuando: 1) El agente es descubierto en la realización del hecho punible. 2) El agente acaba de cometer el hecho punible y es descubierto. 3) El agente ha huido y ha sido identificado durante o inmediatamente después de la perpetración del hecho punible, sea por el agraviado o por otra persona que haya presenciado el hecho, o por medio audiovisual, dispositivos o equipos con cuya tecnología se haya registrado su imagen, y es encontrado dentro de las veinticuatro (24) horas de producido el hecho punible. 4) El agente es encontrado dentro de las veinticuatro (24) horas después de la perpetración del delito con efectos o instrumentos procedentes de aquel o que hubieren sido empleados para cometerlo.",
    "summary": "La policía detiene sin orden judicial en flagrancia: 1) Te atrapan haciéndolo, 2) Acabas de hacerlo, 3) Te identifican en 24h por testigos o cámaras, 4) Te encuentran en 24h con los objetos del delito.",
    "publication_date": "2004-07-29",
    "last_modified": null,
    "official_url": "https://spij.minjus.gob.pe/spij-ext-web/detallegislacion/21702",
    "status": "vigente"
  },
  {
    "id": "cpp_art66",
    "source_type": "codigo_procesal",
    "name": "Código Procesal Penal",
    "article": "Artículo 66 — Conducción compulsiva",
    "full_text": "En caso de inconcurrencia a una citación debidamente notificada bajo apercibimiento, el Ministerio Público dispondrá la conducción compulsiva del omiso por la Policía Nacional.",
    "summary": "Solo el Ministerio Público puede ordenar que te lleven a declarar si no fuiste a una citación. La policía sola no puede hacerlo.",
    "publication_date": "2004-07-29",
    "last_modified": null,
    "official_url": "https://spij.minjus.gob.pe/spij-ext-web/detallegislacion/21702",
    "status": "vigente"
  },
  {
    "id": "cpp_art159_2",
    "source_type": "codigo_procesal",
    "name": "Código Procesal Penal",
    "article": "Artículo 159.2 — Prueba ilícita",
    "full_text": "Carecen de efecto legal las pruebas obtenidas, directa o indirectamente, con violación del contenido esencial de los derechos fundamentales de la persona.",
    "summary": "Las pruebas obtenidas violando tus derechos son ilegales y no valen en un juicio. Si te registraron ilegalmente, lo que encuentren no sirve como evidencia.",
    "publication_date": "2004-07-29",
    "last_modified": null,
    "official_url": "https://spij.minjus.gob.pe/spij-ext-web/detallegislacion/21702",
    "status": "vigente"
  },
  {
    "id": "cp_art299",
    "source_type": "codigo_penal",
    "name": "Código Penal del Perú",
    "article": "Artículo 299 — Posesión no punible",
    "full_text": "No es punible la posesión de droga para el propio e inmediato consumo, en cantidad que no exceda de cinco gramos de pasta básica de cocaína, dos gramos de clorhidrato de cocaína, ocho gramos de marihuana o dos gramos de sus derivados, un gramo de látex de opio o doscientos miligramos de sus derivados o doscientos cincuenta miligramos de éxtasis.",
    "summary": "Tener hasta 8g de marihuana, 5g de PBC, 2g de cocaína o 250mg de éxtasis para consumo personal NO es delito.",
    "publication_date": "1991-04-08",
    "last_modified": null,
    "official_url": "https://spij.minjus.gob.pe/spij-ext-web/detallegislacion/30478",
    "status": "vigente"
  },
  {
    "id": "cp_art368",
    "source_type": "codigo_penal",
    "name": "Código Penal del Perú",
    "article": "Artículo 368 — Resistencia o desobediencia a la autoridad",
    "full_text": "El que desobedece o resiste la orden legalmente impartida por un funcionario público en el ejercicio de sus atribuciones, salvo que se trate de la propia detención, será reprimido con pena privativa de libertad no mayor de dos años.",
    "summary": "Desobedecer una orden LEGÍTIMA del policía puede darte hasta 2 años de pena. Pero la orden debe ser legal — negarte a un registro ilegal NO es desobediencia.",
    "publication_date": "1991-04-08",
    "last_modified": null,
    "official_url": "https://spij.minjus.gob.pe/spij-ext-web/detallegislacion/30478",
    "status": "vigente"
  },
  {
    "id": "cp_art376",
    "source_type": "codigo_penal",
    "name": "Código Penal del Perú",
    "article": "Artículo 376 — Abuso de autoridad",
    "full_text": "El funcionario público que, abusando de sus atribuciones, comete u ordena un acto arbitrario que cause perjuicio a alguien será reprimido con pena privativa de libertad no mayor de tres años.",
    "summary": "Un policía que abusa de su poder puede ir preso hasta 3 años. Esto incluye detenciones arbitrarias, registros ilegales y trato degradante.",
    "publication_date": "1991-04-08",
    "last_modified": null,
    "official_url": "https://spij.minjus.gob.pe/spij-ext-web/detallegislacion/30478",
    "status": "vigente"
  },
  {
    "id": "cp_art321",
    "source_type": "codigo_penal",
    "name": "Código Penal del Perú",
    "article": "Artículo 321 — Tortura",
    "full_text": "El funcionario o servidor público o cualquier persona, con el consentimiento o aquiescencia de aquél, que inflija a otro dolores o sufrimientos graves, sean físicos o mentales, o lo someta a condiciones o métodos que anulen su personalidad o disminuyan su capacidad física o mental, aunque no causen dolor físico o aflicción psíquica, será reprimido con pena privativa de libertad no menor de cinco ni mayor de diez años.",
    "summary": "El policía que torture puede ir preso de 5 a 10 años. Tortura incluye sufrimiento físico Y mental.",
    "publication_date": "1991-04-08",
    "last_modified": null,
    "official_url": "https://spij.minjus.gob.pe/spij-ext-web/detallegislacion/30478",
    "status": "vigente"
  }
]